
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第2节：寄存器与数据传送指令 · 标题</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="作者">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="栈与数据传送指令.html" />
    
    
    <link rel="prev" href="程序的机器级表示.html" />
    

    <link href="https://xxx.xxx.xxx/rss" title="标题" rel="alternate" type="application/rss+xml" />

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../Chapter0/">
            
                <a href="../Chapter0/">
            
                    
                    第零章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../Chapter1/">
            
                <a href="../Chapter1/">
            
                    
                    第一章
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../Chapter1/衣.html">
            
                <a href="../Chapter1/衣.html">
            
                    
                    第1节：衣
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../Chapter1/食.html">
            
                <a href="../Chapter1/食.html">
            
                    
                    第2节：食
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../Chapter1/住.html">
            
                <a href="../Chapter1/住.html">
            
                    
                    第3节：住
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../Chapter1/行.html">
            
                <a href="../Chapter1/行.html">
            
                    
                    第4节：行
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../Chapter2/">
            
                <a href="../Chapter2/">
            
                    
                    第二章
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="./">
            
                <a href="./">
            
                    
                    第三章
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="程序的机器级表示.html">
            
                <a href="程序的机器级表示.html">
            
                    
                    第1节：程序的机器级表示
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5.2" data-path="寄存器与数据传送指令.html">
            
                <a href="寄存器与数据传送指令.html">
            
                    
                    第2节：寄存器与数据传送指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="栈与数据传送指令.html">
            
                <a href="栈与数据传送指令.html">
            
                    
                    第3节：栈与数据传送指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="算术和逻辑运算指令.html">
            
                <a href="算术和逻辑运算指令.html">
            
                    
                    第4节：算术和逻辑运算指令
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../Chapter4/">
            
                <a href="../Chapter4/">
            
                    
                    第四章
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第2节：寄存器与数据传送指令</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x5728;&#x8BB2;&#x8FF0;&#x7B2C;&#x4E00;&#x7AE0;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x6F2B;&#x6E38;&#x65F6;&#xFF0C;&#x63D0;&#x5230;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x4E2D;&#x4FE1;&#x606F;&#x7684;&#x5B58;&#x50A8;&#x90E8;&#x4EF6;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x5185;&#x5B58;&#x548C;&#x786C;&#x76D8;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x5BF9;&#x5BC4;&#x5B58;&#x5668;&#x4F1A;&#x964C;&#x751F;&#x4E00;&#x4E9B;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x3002;</p>
<p><img src="pic/image-20240617232701775.png" alt="image-20240617232701775"></p>
<p>&#x6700;&#x65E9;8086&#x7684;&#x5904;&#x7406;&#x5668;&#x4E2D;&#xFF0C;&#x5305;&#x542B;8&#x4E2A;16&#x4F4D;&#x7684;&#x901A;&#x7528;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x5177;&#x4F53;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002;&#x6BCF;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#x90FD;&#x6709;&#x7279;&#x6B8A;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x540D;&#x5B57;&#x5C31;&#x53CD;&#x6620;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x9014;&#x3002;</p>
<p><img src="pic/image-20240617232726583.png" alt="image-20240617232726583"></p>
<p>&#x5F53;&#x5904;&#x7406;&#x5668;&#x4ECE;16&#x4F4D;&#x6269;&#x5C55;&#x5230;32&#x4F4D;&#x65F6;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x4F4D;&#x6570;&#x4E5F;&#x968F;&#x4E4B;&#x6269;&#x5C55;&#x5230;&#x4E86;32&#x4F4D;</p>
<p><img src="pic/image-20240617232809810.png" alt="image-20240617232809810">&#x76F4;&#x5230;&#x4ECA;&#x5929;64&#x4F4D;&#x7684;&#x5904;&#x7406;&#x5668;&#x4E2D;&#xFF0C;&#x539F;&#x6765;8&#x4E2A;16&#x4F4D;&#x5BC4;&#x5B58;&#x5668;&#x5DF2;&#x7ECF;&#x6269;&#x5C55;&#x6210;&#x4E86;64&#x4F4D;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x589E;&#x52A0;&#x4E86;8&#x4E2A;&#x65B0;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x3002;&#x5728;&#x4E00;&#x822C;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x626E;&#x6F14;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x7F16;&#x7A0B;&#x89C4;&#x8303;&#x89C4;&#x5B9A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5BC4;&#x5B58;&#x5668;&#x3002;</p>
<p><img src="pic/image-20240617232844207.png" alt="image-20240617232844207"></p>
<p>&#x4F8B;&#x5982;&#xFF0C;<u>&#x5BC4;&#x5B58;&#x5668;<code>rax</code>&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x51FD;&#x6570;&#x7684;&#x8FD4;&#x56DE;&#x503C;</u>&#xFF0C;<u>&#x5BC4;&#x5B58;&#x5668;<code>rsp</code>&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x7A0B;&#x5E8F;&#x6808;&#x7684;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;</u>&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;<u><strong>6&#x4E2A;</strong></u>&#x5BC4;&#x5B58;&#x5668;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x4F20;&#x9012;&#x51FD;&#x6570;&#x53C2;&#x6570;&#xFF0C;&#x5728;&#x4E86;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x7528;&#x6CD5;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x53BB;&#x7406;&#x89E3;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x5C31;&#x4F1A;&#x5BB9;&#x6613;&#x591A;&#x4E86;&#x3002;</p>
<p><img src="pic/image-20240617233103138.png" alt="image-20240617233103138"></p>
<p><img src="pic/image-20240617233612417.png" alt="image-20240617233612417"></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x6307;&#x4EE4;&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x3002;&#x5927;&#x591A;&#x6570;&#x6307;&#x4EE4;&#x5305;&#x542B;&#x4E24;&#x90E8;&#x5206;&#xFF0C;<u><strong>&#x64CD;&#x4F5C;&#x7801;&#x548C;&#x64CD;&#x4F5C;&#x6570;</strong></u>&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x56FE;&#x4E2D;&#x7684;&#x8FD9;&#x51E0;&#x6761;&#x6307;&#x4EE4;&#xFF0C;<code>movq</code>,<code>addq</code>,&apos;<code>subq</code>,&#x8FD9;&#x90E8;&#x5206;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x64CD;&#x4F5C;&#x7801;&#xFF0C;&#x5B83;&#x51B3;&#x5B9A;&#x4E86;CPU&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x64CD;&#x4F5C;&#x7801;&#x4E4B;&#x540E;&#x7684;&#x8FD9;&#x90E8;&#x5206;&#x662F;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x6307;&#x4EE4;&#x5177;&#x6709;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x591A;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x4E0D;&#x8FC7;&#x50CF;<code>ret</code>&#x8FD4;&#x56DE;&#x6307;&#x4EE4;&#xFF0C;&#x662F;&#x6CA1;&#x6709;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x3002;</p>
<p><img src="pic/image-20240617233725303.png" alt="image-20240617233725303"></p>
<p>&#x4E0D;&#x540C;&#x6307;&#x4EE4;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x5927;&#x81F4;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E09;&#x7C7B;&#xFF0C;<u><strong>&#x5206;&#x522B;&#x662F;&#x7ACB;&#x5373;&#x6570;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x4EE5;&#x53CA;&#x5185;&#x5B58;&#x5F15;&#x7528;</strong></u>&#xFF0C;&#x5728;AT&amp;T&#x683C;&#x5F0F;&#x7684;&#x6C47;&#x7F16;&#x4E2D;&#xFF0C;&#x7ACB;&#x5373;&#x6570;&#x662F;&#x4EE5;$&#x5F00;&#x5934;&#x7684;&#xFF0C;&#x540E;&#x9762;&#x8DDF;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x6574;&#x6570;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x6807;&#x51C6;C&#x8BED;&#x8A00;&#x7684;&#x5B9A;&#x4E49;&#xFF1B;&#x64CD;&#x4F5C;&#x6570;&#x662F;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x60C5;&#x51B5;&#x4E5F;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x5373;&#x4F7F;&#x5728;64&#x4F4D;&#x7684;&#x5904;&#x7406;&#x5668;&#x4E0A;&#xFF0C;&#x4E0D;&#x4EC5;64&#x4F4D;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;32&#x4F4D;&#xFF0C;16&#x4F4D;&#x751A;&#x81F3;8&#x4F4D;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x90FD;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x64CD;&#x4F5C;&#x6570;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x56FE;&#x4E2D;&#x8FD9;&#x79CD;&#x5BC4;&#x5B58;&#x5668;&#x5E26;&#x4E86;&#x5C0F;&#x62EC;&#x53F7;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5B83;&#x6240;&#x8868;&#x793A;&#x7684;&#x662F;&#x5185;&#x5B58;&#x5F15;&#x7528;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x91CD;&#x70B9;&#x770B;&#x4E00;&#x4E0B;&#x5185;&#x5B58;&#x5F15;&#x7528;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p><img src="pic/image-20240617233935214.png" alt="image-20240617233935214"></p>
<p>&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x5C06;&#x5185;&#x5B58;&#x62BD;&#x8C61;&#x4E3A;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x6570;&#x7EC4;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x5B58;&#x53D6;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x76EE;&#x7684;&#x6570;&#x636E;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;<strong>addr</strong>,&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x957F;&#x5EA6;<strong>b</strong>,&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7B26;&#x53F7;<script type="math/tex; ">M_b[addr]</script> &#x6765;&#x8868;&#x793A;&#x5185;&#x5B58;&#x5F15;&#x7528;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x4FBF;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x7701;&#x7565;&#x4E0B;&#x6807;b&#xFF0C;&#x6700;&#x5E38;&#x7528;&#x7684;&#x5185;&#x5B58;&#x5F15;&#x7528;&#x5305;&#x542B;4&#x90E8;&#x5206;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x4E00;&#x4E2A;&#x7ACB;&#x5373;&#x6570;&#xFF0C;&#x4E00;&#x4E2A;&#x57FA;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x4E00;&#x4E2A;&#x53D8;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x548C;&#x4E00;&#x4E2A;&#x6BD4;&#x4F8B;&#x56E0;&#x5B50;&#xFF0C;</p>
<p><script type="math/tex; ">
Imm \rightarrow Immediate(立即数)\\
r_b \rightarrow Base Register(基址寄存器) \\
r_i \rightarrow Index Register(变址寄存器) \\
s \rightarrow Scale Factor(比例因子)[1,2,4,8]
</script></p>
<p>&#x5F15;&#x7528;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x65F6;&#xFF0C;&#x4F1A;&#x4F7F;&#x7528;&#x5230;&#x8FD9;&#x79CD;&#x901A;&#x7528;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x6709;&#x6548;&#x5730;&#x5740;&#x662F;&#x901A;&#x8FC7;<u><strong>&#x7ACB;&#x5373;&#x6570;&#x4E0E;&#x57FA;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x503C;&#x76F8;&#x52A0;</strong></u>&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x53D8;&#x5740;&#x5BC4;&#x5B58;&#x5668;&#x4E0E;&#x6BD4;&#x4F8B;&#x56E0;&#x5B50;&#x7684;&#x4E58;&#x79EF;&#xFF0C;
<script type="math/tex; ">
Imm(r_b,r_i,s) \rightarrow Imm + R[r_b] + R[r_i]*s
</script>
&#x6BD4;&#x4F8B;&#x56E0;&#x5B50;&#x7684;&#x53D6;&#x503C;&#x5FC5;&#x987B;&#x662F;1&#xFF0C;2&#xFF0C;4&#xFF0C;8&#xFF1B;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6BD4;&#x4F8B;&#x56E0;&#x5B50;&#x7684;&#x53D6;&#x503C;&#x662F;&#x4E0E;&#x6E90;&#x4EE3;&#x7801;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x662F;&#x76F8;&#x5173;&#x7684;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x6839;&#x636E;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x6765;&#x786E;&#x5B9A;&#x6BD4;&#x4F8B;&#x56E0;&#x5B50;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5B9A;&#x4E49;<strong>char</strong>&#x7C7B;&#x578B;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x6BD4;&#x4F8B;&#x56E0;&#x5B50;&#x5C31;&#x662F;1&#xFF0C;<strong>int</strong>&#x7C7B;&#x578B;&#xFF0C;&#x6BD4;&#x4F8B;&#x56E0;&#x5B50;&#x5C31;&#x662F;4&#xFF0C;&#x81F3;&#x4E8E;<strong>double</strong>&#x7C7B;&#x578B;&#xFF0C;&#x6BD4;&#x4F8B;&#x56E0;&#x5B50;&#x5C31;&#x662F;8&#xFF0C;&#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#x7684;&#x5185;&#x5B58;&#x5F15;&#x7528;&#x90FD;&#x662F;&#x8FD9;&#x79CD;&#x666E;&#x901A;&#x5F62;&#x5F0F;&#x7684;&#x53D8;&#x79CD;&#xFF0C;&#x7701;&#x7565;&#x4E86;&#x5176;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x90E8;&#x5206;&#xFF0C;&#x56FE;&#x4E2D;&#x5217;&#x51FA;&#x4E86;&#x5185;&#x5B58;&#x5F15;&#x7528;&#x7684;&#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#xFF0C;&#x9700;&#x8981;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x5230;&#x4E24;&#x79CD;&#x662F;&#x4E0D;&#x5E26;$&#x7B26;&#x53F7;&#x7684;&#x7ACB;&#x5373;&#x6570;&#xFF0C;&#x548C;&#x5E26;&#x4E86;&#x62EC;&#x53F7;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x3002;</p>
<p><img src="pic/image-20240617234352785.png" alt="image-20240617234352785"></p>
<p>&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x8FC7;move&#x7C7B;&#x6307;&#x4EE4;&#xFF0C;&#x5B83;&#x5305;&#x542B;<code>movb</code>,<code>movw</code>,<code>movl</code>&#x4EE5;&#x53CA;<code>movq</code>&#x8FD9;&#x56DB;&#x6761;&#x6307;&#x4EE4;&#xFF0C;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x6267;&#x884C;&#x76F8;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x90FD;&#x662F;&#x628A;&#x6570;&#x636E;&#x4ECE;&#x6E90;&#x4F4D;&#x7F6E;&#x590D;&#x5236;&#x5230;&#x76EE;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E3B;&#x8981;&#x533A;&#x522B;&#xFF0C;&#x5728;&#x4E8E;&#x4ED6;&#x4EEC;&#x6240;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x4E0D;&#x540C;&#xFF0C;&#x5177;&#x4F53;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="pic/image-20240617234522558.png" alt="image-20240617234522558"></p>
<p>&#x5BF9;&#x4E8E;<code>MOV</code>&#x7C7B;&#x6307;&#x4EE4;&#xFF0C;&#x542B;&#x6709;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#xFF1B;&#x5BF9;&#x4E8E;<u><strong>&#x6E90;&#x64CD;&#x4F5C;&#x6570;</strong></u>&#xFF0C;&#x53EF;&#x4EE5;&#x662F;<u><strong>&#x7ACB;&#x5373;&#x6570;&#xFF0C;&#x4E00;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5185;&#x5B58;&#x5F15;&#x7528;</strong></u>&#xFF1B;&#x7531;&#x4E8E;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x662F;&#x7528;&#x6765;&#x5B58;&#x653E;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6240;&#x4EE5;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x8981;&#x4E48;&#x662F;&#x4E00;&#x4E2A;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x5F15;&#x7528;&#xFF0C;&#x6CE8;&#x610F;&#xFF0C;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x4E0D;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x7ACB;&#x5373;&#x6570;&#xFF1B;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;x86-64&#x5904;&#x7406;&#x5668;&#x6709;&#x4E00;&#x6761;&#x9650;&#x5236;&#xFF0C;&#x5C31;&#x662F;<code>mov</code>&#x6307;&#x4EE4;&#x7684;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#x548C;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x4E0D;&#x80FD;&#x90FD;&#x662F;&#x5185;&#x5B58;&#x7684;&#x5730;&#x5740;&#xFF0C;</p>
<p><img src="pic/image-20240617234656294.png" alt="image-20240617234656294"></p>
<p>&#x5F53;&#x9700;&#x8981;&#x5C06;&#x4E00;&#x4E2A;&#x6570;&#x4ECE;&#x5185;&#x5B58;&#x7684;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x64CD;&#x4F5C;&#xFF1F;</p>
<p>&#x6B64;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4E24;&#x6761;<code>mov</code>&#x6307;&#x4EE4;&#x6765;&#x5B8C;&#x6210;&#xFF0C;</p>
<pre><code class="lang-shell">mov memory, register
mov register, memory
</code></pre>
<p>&#x7B2C;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x5C06;&#x5185;&#x5B58;&#x6E90;&#x4F4D;&#x7F6E;&#x7684;&#x6570;&#x636E;&#x52A0;&#x8F7D;&#x5230;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x7B2C;&#x4E8C;&#x6761;&#x6307;&#x4EE4;&#x518D;&#x5C06;&#x8BE5;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x503C;&#x5199;&#x5165;&#x5185;&#x5B58;&#x7684;&#x76EE;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x51E0;&#x4E2A;&#x6709;&#x5173;<code>mov</code>&#x6307;&#x4EE4;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="pic/image-20240617234805775.png" alt="image-20240617234805775"></p>
<p>&#x56FE;&#x4E2D;&#x7684;&#x6307;&#x4EE4;&#x7ED9;&#x51FA;&#x4E86;&#x4E0D;&#x540C;&#x539F;&#x64CD;&#x4F5C;&#x6570;&#x548C;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;mov&#x6307;&#x4EE4;&#x7684;&#x540E;&#x7F00;&#x4E0E;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x5927;&#x5C0F;&#x4E00;&#x5B9A;&#x5F97;&#x662F;&#x5339;&#x914D;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x5BC4;&#x5B58;&#x5668;<code>%eax</code>&#x662F;32&#x4F4D;&#xFF0C;&#x4E0E;&#x53CC;&#x5B57;l&#x5BF9;&#x5E94;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;<code>%al</code>&#x662F;8&#x4F4D;&#xFF0C;&#x4E0E;&#x5B57;&#x8282;b&#x5BF9;&#x5E94;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;<code>mov</code>&#x6307;&#x4EE4;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x3002;</p>
<p><img src="pic/image-20240617235233786.png" alt="image-20240617235233786"></p>
<p>&#x5F53;<code>movq</code>&#x6307;&#x4EE4;&#x7684;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#x662F;64&#x4F4D;&#x65F6;&#xFF0C;&#x8BE5;&#x7ACB;&#x5373;&#x6570;&#x53EA;&#x80FD;&#x662F;32&#x4F4D;&#x7684;&#x8865;&#x7801;&#x8868;&#x793A;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x8BE5;&#x6570;&#x503C;&#x8FDB;&#x884C;&#x7B26;&#x53F7;&#x4F4D;&#x6269;&#x5C55;&#x4E4B;&#x540E;&#xFF0C;&#x5C06;&#x5F97;&#x5230;&#x7684;64&#x4F4D;&#x6570;&#x4F20;&#x9001;&#x5230;&#x76EE;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x4E2A;&#x9650;&#x5236;&#x4F1A;&#x5E26;&#x6765;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x7ACB;&#x5373;&#x6570;&#x662F;64&#x4F4D;&#x65F6;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x5904;&#x7406;&#xFF1F;&#x8FD9;&#x91CC;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6307;&#x4EE4;&#xFF0C;<code>movabsq</code>&#xFF0C;</p>
<p><img src="pic/image-20240617235354339.png" alt="image-20240617235354339"></p>
<p>&#x8BE5;&#x6307;&#x4EE4;&#x7684;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x7684;64&#x4F4D;&#x7ACB;&#x5373;&#x6570;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x4EC5;&#x80FD;&#x662F;&#x5BC4;&#x5B58;&#x5668;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528;<code>mov</code>&#x6307;&#x4EE4;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x4F20;&#x9001;&#x65F6;&#xFF0C;&#x5BF9;&#x4E8E;&#x76EE;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x4FEE;&#x6539;&#x7ED3;&#x679C;&#x662F;&#x600E;&#x4E48;&#x6837;&#x7684;</p>
<pre><code class="lang-shell">movabsq $0x0011223344556677,    %rax
movb    $-1                        %al
movw    $-1                     %ax
movl    $-1                     %eax
</code></pre>
<p>&#x9996;&#x5148;&#xFF0C;&#x4F7F;&#x7528;movabsq&#x6307;&#x4EE4;&#x5C06;&#x4E00;&#x4E2A;64&#x4F4D;&#x7684;&#x7ACB;&#x5373;&#x6570;&#x590D;&#x5236;&#x5230;&#x5BC4;&#x5B58;&#x5668;<code>rax</code>,&#x6B64;&#x65F6;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;<code>rax</code>&#x5185;&#x4FDD;&#x5B58;&#x7684;&#x6570;&#x503C;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3001;</p>
<p><img src="pic/image-20240617235533744.png" alt="image-20240617235533744"></p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x4F7F;&#x7528;movb&#x6307;&#x4EE4;&#x5C06;&#x7ACB;&#x5373;&#x6570;-1&#x590D;&#x5236;&#x5230;&#x5BC4;&#x5B58;&#x5668;<code>al</code>&#xFF0C;&#x5BC4;&#x5B58;&#x5668;<code>al</code>&#x7684;&#x957F;&#x5EA6;&#x4E3A;8&#xFF0C;&#x4E0E;<code>movb</code>&#x6307;&#x4EE4;&#x6240;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x4E00;&#x81F4;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x5BC4;&#x5B58;&#x5668;<code>rax</code>&#x7684;&#x4F4E;8&#x4F4D;&#x53D1;&#x751F;&#x4E86;&#x6539;&#x53D8;&#xFF0C;</p>
<p><img src="pic/image-20240617235757538.png" alt="image-20240617235757538"></p>
<p>&#x7B2C;&#x4E09;&#x6761;&#x6307;&#x4EE4;<code>movw</code> &#x662F;&#x5C06;&#x7ACB;&#x5373;&#x6570;-1&#x590D;&#x5236;&#x5230;&#x5BC4;&#x5B58;&#x5668;<code>ax</code>,&#x5BC4;&#x5B58;&#x5668;&#x4F4E;16&#x4F4D;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#x3002;</p>
<p><img src="pic/image-20240618000535199.png" alt="image-20240618000535199"> </p>
<p>&#x5F53;&#x6307;&#x4EE4;<code>movl</code>&#x5C06;&#x7ACB;&#x5373;&#x6570;-1&#x590D;&#x5236;&#x5230;&#x5BC4;&#x5B58;&#x5668;<code>eax</code>&#x65F6;&#xFF0C;&#x6B64;&#x65F6;&#x5BC4;&#x5B58;&#x5668;<code>rax</code>&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4F4E;32&#x4F4D;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#xFF0C;&#x800C;&#x4E14;&#x9AD8;32&#x4F4D;&#x4E5F;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#xFF0C;</p>
<p><img src="pic/image-20240618001239780.png" alt="image-20240618001239780"></p>
<p>&#x5F53;<code>movl</code>&#x7684;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x662F;&#x5BC4;&#x5B58;&#x5668;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x628A;&#x8BE5;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x9AD8;4&#x8282;&#x8BBE;&#x7F6E;&#x4F4D;0&#xFF0C;&#x8FD9;&#x662F;x86-64&#x5904;&#x7406;&#x5668;&#x7684;&#x4E00;&#x4E2A;&#x89C4;&#x5B9A;&#x3002;<u><strong>&#x5373;&#x4EFB;&#x4F55;&#x4F4D;&#x5BC4;&#x5B58;&#x5668;&#x751F;&#x6210;32&#x4F4D;&#x503C;&#x7684;&#x6307;&#x4EE4;&#x90FD;&#x4F1A;&#x628A;&#x8BE5;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#x9AD8;&#x4F4D;&#x90E8;&#x5206;&#x7F6E;&#x4E3A;0&#xFF0C;</strong></u>&#x4EE5;&#x4E0A;&#x4ECB;&#x7ECD;&#x7684;&#x90FD;&#x662F;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#x4E0E;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x5927;&#x5C0F;&#x4E00;&#x81F4;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x5F53;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#x6570;&#x4F4D;&#x5C0F;&#x4E8E;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x5269;&#x4F59;&#x7684;&#x5B57;&#x8282;&#x8FDB;&#x884C;0&#x6269;&#x5C55;&#x6216;&#x8005;&#x7B26;&#x53F7;&#x4F4D;&#x6269;&#x5C55;&#xFF0C;&#x96F6;&#x6269;&#x5C55;&#x6570;&#x636E;&#x4F20;&#x9001;&#x6307;&#x4EE4;&#x6709;&#x4E94;&#x6761;&#xFF0C;&#x5176;&#x4E2D;&#x5B57;&#x7B26;z&#x662F;zero&#x7684;&#x7F29;&#x5199;&#x3002;&#x6307;&#x4EE4;&#x6700;&#x540E;&#x7684;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x90FD;&#x662F;&#x5927;&#x5C0F;&#x6307;&#x6807;&#x7B26;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x8868;&#x793A;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5B57;&#x6BCD;&#x8868;&#x793A;&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p><img src="pic/image-20240618001659940.png" alt="image-20240618001659940"></p>
<p>&#x7B26;&#x53F7;&#x4F4D;&#x6269;&#x5C55;&#x4F20;&#x9001;&#x6307;&#x4EE4;&#x6709;6&#x6761;&#xFF0C;&#x5176;&#x4E2D;&#x5B57;&#x7B26;s&#x662F;sign&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x540C;&#x6837;&#xFF0C;&#x6307;&#x4EE4;&#x6700;&#x540E;&#x7684;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E5F;&#x662F;&#x5927;&#x5C0F;&#x6307;&#x793A;&#x7B26;&#x3002;</p>
<p><img src="pic/image-20240618002235155.png" alt="image-20240618002235155"></p>
<p><img src="pic/image-20240618002419831.png" alt="image-20240618002419831"></p>
<p>&#x5BF9;&#x6BD4;&#x96F6;&#x6269;&#x5C55;&#x548C;&#x7B26;&#x53F7;&#x4F4D;&#x6269;&#x5C55;&#xFF0C;<u><strong>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x7B26;&#x53F7;&#x4F4D;&#x6269;&#x5C55;&#x6BD4;&#x96F6;&#x6269;&#x5C55;&#x591A;&#x4E86;&#x4E00;&#x6761;4&#x5B57;&#x8282;&#x5230;8&#x5B57;&#x8282;&#x7684;&#x6269;&#x5C55;&#x6307;&#x4EE4;</strong></u>&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x96F6;&#x6269;&#x5C55;&#x6CA1;&#x6709;<code>movzlq</code>&#x7684;&#x6307;&#x4EE4;&#x5462;&#xFF1F;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x6570;&#x636E;&#x4F20;&#x9001;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>movl</code>&#x6307;&#x4EE4;&#x6765;&#x5B9E;&#x73B0;&#xFF1B;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x7B26;&#x53F7;&#x4F4D;&#x6269;&#x5C55;&#x8FD8;&#x6709;&#x4E00;&#x6761;&#x6CA1;&#x6709;&#x64CD;&#x4F5C;&#x6570;&#x7684;&#x7279;&#x6B8A;&#x6307;&#x4EE4;<code>cltq</code>,&#x8BE5;&#x6307;&#x4EE4;&#x7684;&#x6E90;&#x64CD;&#x4F5C;&#x6570;&#x603B;&#x662F;&#x5BC4;&#x5B58;&#x5668;<code>eax</code>,&#x76EE;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x603B;&#x662F;&#x5BC4;&#x5B58;&#x5668;<code>rax</code>,     <code>cltq</code>&#x7684;&#x6548;&#x679C;&#x548C; <code>movslq %eax, %rax</code></p>
<p><img src="pic/image-20240618002909334.png" alt="image-20240618002909334"></p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; &#x7248;&#x6743;&#x4FE1;&#x606F; all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x4EF6;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2024-06-18 00:29:54
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="程序的机器级表示.html" class="navigation navigation-prev " aria-label="Previous page: 第1节：程序的机器级表示">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="栈与数据传送指令.html" class="navigation navigation-next " aria-label="Next page: 第3节：栈与数据传送指令">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第2节：寄存器与数据传送指令","level":"1.5.2","depth":2,"next":{"title":"第3节：栈与数据传送指令","level":"1.5.3","depth":2,"path":"Chapter3/栈与数据传送指令.md","ref":"Chapter3/栈与数据传送指令.md","articles":[]},"previous":{"title":"第1节：程序的机器级表示","level":"1.5.1","depth":2,"path":"Chapter3/程序的机器级表示.md","ref":"Chapter3/程序的机器级表示.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-pro","expandable-chapters-small","splitter","back-to-top-button","expandable-chapters-small","-sharing","github","code","page-toc-button","tbfed-pagefooter","rss","mathjax-pro"],"root":".","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy 版权信息","modify_label":"该文件修订时间：","modify_format":"YYYY-MM-DD HH:mm:ss"},"github":{"url":"https://github.com/YGVICTOR/my_blog"},"splitter":{},"search-pro":{},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"rss":{"categories":[],"title":"标题","description":"描述信息","author":"作者","feed_url":"https://xxx.xxx.xxx/rss","site_url":"https://xxx.xxx.xxx/"},"highlight":{},"page-toc-button":{"maxTocDepth":2,"minTocSize":2},"back-to-top-button":{},"mathjax-pro":{"forceSVG":false,"version":"2.7.7"},"expandable-chapters-small":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"作者","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"标题","language":"zh-hans","output.name":"site","gitbook":"3.2.3","description":"描述信息"},"file":{"path":"Chapter3/寄存器与数据传送指令.md","mtime":"2024-06-17T16:29:54.219Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-06-21T16:24:01.941Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-rss/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.7/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-mathjax-pro/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

